app/controllers/gyms_controller.rb

  def index
    @gyms = Gym.all
---
SELECT "gyms".* FROM "gyms"

  def update
    respond_to do |format|
      if @gym.update(gym_params)
---
UPDATE "gyms" SET "telephone" = ?, "updated_at" = ? WHERE "gyms"."id" = 5

  def destroy
    @gym.destroy
---
DELETE FROM "gyms" WHERE "gyms"."id" = ?

    def set_gym
      @gym = Gym.find(params[:id])
---
SELECT  "gyms".* FROM "gyms"  WHERE "gyms"."id" = ? LIMIT 1