app/controllers/schedules_controller.rb

  def index
    @schedules = Schedule.all
---
SELECT "schedules".* FROM "schedules"

  def destroy
    @schedule.destroy
---
DELETE FROM "schedules" WHERE "schedules"."id" = ?

    def set_schedule
      @schedule = Schedule.find(params[:id])
---
SELECT  "schedules".* FROM "schedules"  WHERE "schedules"."id" = ? LIMIT 1