app/controllers/welcome_controller.rb

SELECT "gyms".* FROM "gyms"
SELECT "schedules".* FROM "schedules"
---
  def index
    @gyms = Gym.all
    @schedules = Schedule.all